# CannotUseAreaReinforcementHookTypeStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..CannotUseAreaReinforcementHookTypeStyle Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
At least one of the bars in the Area Reinforcement has a Bar Type or Shape that is incompatible with the Hook type. Check the Hook permissions for the Bar Type (see Hook Lengths) and the Hook and Rebar Shape styles.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotUseAreaReinforcementHookTypeStyle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotUseAreaReinforcementHookTypeStyle As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotUseAreaReinforcementHookTypeStyle {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace